Revit 2027 API
TransferredProjectStandardsEventArgs Class
 The event arguments used by the TransferredProjectStandards event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPISingleEventArgs
 Autodesk.Revit.UI.Events.TransferredProjectStandardsEventArgs
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class TransferredProjectStandardsEventArgs : RevitAPISingleEventArgs
Public Class TransferredProjectStandardsEventArgs
	Inherits RevitAPISingleEventArgs
public ref class TransferredProjectStandardsEventArgs : public RevitAPISingleEventArgs
type TransferredProjectStandardsEventArgs =
    class
        inherit RevitAPISingleEventArgs
    end
The TransferredProjectStandardsEventArgs type exposes the following members.
Properties
Name | Description
Cancellable |  Indicates whether an event may be cancelled by an event delegate.
(Inherited from RevitAPIEventArgs)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RevitAPIEventArgs)
SourceDocument |  Source document.
TargetDocument |  Target document.
Top
Methods
Name | Description
Dispose
(Inherited from RevitAPIEventArgs)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetSelectedExternalItems |  Gets the collection of externally added items that the user opted to enable for transfer in the Transfer Project Standards dialog.
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsCancelled |  Indicates whether the event is being cancelled.
(Inherited from RevitAPIEventArgs)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.UI.Events Namespace